// Console.WriteLine (" Введи число ");
// int x = Convert.ToInt32(Console.ReadLine());
// int y = x * x;
// Console.WriteLine($"Квадрат Вашего числа {x} -> {y}");

// 1. Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.
// a = 25; b = 5 -> да
// a = 2 b = 10 -> нет
// a = 9; b = -3 -> да
// a = -3 b = 9 -> нет

// Console.WriteLine ("Введите первое число");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine ("Введите второе число");
// int b = Convert.ToInt32(Console.ReadLine());

// int quad = b*b;
// if(quad == a)
// {
//     Console.WriteLine ($"{a} is quad of {b}");
// }
// else 
// {
//     Console.WriteLine ($"{a} is not quad of {b}");
// }

// 1. Напишите программу, которая принимает на вход трехзначное число и на выходе показывает ""последнюю" цифиру этого числа.

// 356 -> 6
// 782 -> 2
// 918 -> 8

